Documents/ПланированиеАвансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПланированиеАвансов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияБазыРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СпособыНачисленияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПоказаниямПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуЖильцов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуМашиноМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнымЗначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммисияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДополнительнымРеквизитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуПриборов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПотребителейУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПотребителейУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прописанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживающие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланированиеАвансов/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
  	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеДатыДокумента = Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
	ОтображениеПериодаНачисленияБазыРаспределения = Формат(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения, НСтр(ФорматнаяСтрока));

	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.Элементы.ОтображениеДатыДокумента.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.Услуга.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
		Элементы.ПраваяКолонка.Видимость = Ложь;
	Иначе
		Элементы.ПраваяКолонка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура - обработчик команды "ЗаполнитьСОтбором".
//
&НаКлиенте
Процедура ЗаполнитьСОтбором(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация)  Тогда
		ТекстСообщения = НСтр("ru='Не заполнен реквизит Организация.';uk='Не заповнений реквізит Організація.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		Объект.Дата);
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		ЗаполнитьКоличествоБазыРаспределенияНаСервере();
		ЗаполнитьСуммыАванса();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьАвтоматически".
//
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru='Таблица распределения будет очищена, продолжить?';uk='Таблиця розподілу буде очищена, продовжити?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ЛицевыеСчета.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьАвтоматическиНаСервере();
	ЗаполнитьКоличествоБазыРаспределенияНаСервере();
	ЗаполнитьСуммыАванса();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.ЛицевойСчет,
		|	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК ЛицевойСчетОбъектЛицевогоСчетаКод
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Период >= &ДатаНач
		|	И ЛицевыеСчета.Период <= &ДатаКон
		|	И ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаНач,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Действует) КАК ЛицевыеСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетОбъектЛицевогоСчетаКод";
		
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("Здание", Объект.Здание);
		
		Объект.ЛицевыеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

// Процедура - обработчик команды "Распределить".
//
&НаКлиенте
Процедура Распределить(Команда)
	
	РаспределитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	
	ЗначениеКорректировкиОкругления = 0.01;
	ИтогБазыРаспределения = Объект.ЛицевыеСчета.Итог("КоличествоБазыРаспределения");
	
	Если ИтогБазыРаспределения = 0 Тогда
		
		ТекстСсобщения = Нстр("ru = 'Итог базы распределения равен нулю. Распределение невозможно.'; uk = 'Підсумок бази розподілу дорівнює нулю. Розподіл неможливий.'");
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСсобщения;
		
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;	
		
	ОшибкаОкругления = 0;
	Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
		
		СуммаНачислено = Объект.СуммаДокумента * (СтрокаЛицевыеСчета.КоличествоБазыРаспределения / ИтогБазыРаспределения);
		СтрокаЛицевыеСчета.СуммаНачислено = СуммаНачислено;
		
		ОшибкаОкругления = ОшибкаОкругления + (СуммаНачислено - СтрокаЛицевыеСчета.СуммаНачислено);
		Если ОшибкаОкругления >= ЗначениеКорректировкиОкругления Тогда
			СтрокаЛицевыеСчета.СуммаНачислено = СтрокаЛицевыеСчета.СуммаНачислено + ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления - ЗначениеКорректировкиОкругления;
		ИначеЕсли ОшибкаОкругления <= -ЗначениеКорректировкиОкругления Тогда
			СтрокаЛицевыеСчета.СуммаНачислено = СтрокаЛицевыеСчета.СуммаНачислено - ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления + ЗначениеКорректировкиОкругления;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
		
		Если СтрокаЛицевыеСчета.СуммаНачислено > 0 Тогда
			СтрокаЛицевыеСчета.СуммаНачислено = СтрокаЛицевыеСчета.СуммаНачислено + (Объект.СуммаДокумента - Объект.ЛицевыеСчета.Итог("СуммаНачислено"));
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
		
		СтрокаЛицевыеСчета.СуммаНачислено = Макс((СтрокаЛицевыеСчета.СуммаНачислено  - СтрокаЛицевыеСчета.СуммаАванса), 0);
		
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоБазыРаспределенияНаСервере()
	
	Если Объект.Услуга.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
		
		Если ТипЗнч(Объект.Услуга.БазаРаспределенияРасчетнойУслуги) = Тип("ПеречислениеСсылка.ВидыПотребителейУслуг") Тогда
			
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
				|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
				|	ВЫБОР
				|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
				|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
				|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
				|	КОНЕЦ КАК ЗначениеБазы
				|ИЗ
				|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
				|			&Период,
				|			ЛицевойСчет.Владелец = &Здание
				|				И Услуга = &Услуга
				|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК НазначенныеУслугиСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
				|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
				|ГДЕ
				|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА";
			
		Иначе
			
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
				|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
				|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета
				|ИЗ
				|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
				|			&Период,
				|			ЛицевойСчет.Владелец = &Здание
				|				И Услуга = &Услуга
				|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК НазначенныеУслугиСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
				|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
				|ГДЕ
				|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА";
				
		КонецЕсли;	
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
			
		Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.Дата));		
		Запрос.УстановитьПараметр("Услуга", Объект.Услуга);		
		Запрос.УстановитьПараметр("ВидБазыРаспределения", Объект.Услуга.БазаРаспределенияРасчетнойУслуги);		
		Запрос.УстановитьПараметр("Здание", Объект.Здание);
		Запрос.УстановитьПараметр("СписокЛицевыхСчетов", Объект.ЛицевыеСчета.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));		
		
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
			НайденнаяСтрока = ТаблицаЗапроса.Найти(СтрокаЛицевыеСчета.ЛицевойСчет, "ЛицевойСчет");
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаЛицевыеСчета.КоличествоБазыРаспределения = НайденнаяСтрока.ЗначениеБазы;
			
		КонецЦикла;
		
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет КАК ЛицевойСчет,
			|	СУММА(РасчетыПоЛицевымСчетамОбороты.СуммаПриход) КАК СуммаПриход
			|ИЗ
			|	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
			|			&ДатаНач,
			|			&ДатаКон,
			|			,
			|			МесяцНачисления = &МесяцНачисления
			|				И ЛицевойСчет.Владелец = &Здание
			|				И ЛицевойСчет В (&спЛицевыеСчета)
			|				И Услуга В (&спУслуги)) КАК РасчетыПоЛицевымСчетамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
			|
			|УПОРЯДОЧИТЬ ПО
			|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет.Наименование";
			
		Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодНачисленияБазыРаспределения));		
		Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодНачисленияБазыРаспределения));		
		Запрос.УстановитьПараметр("МесяцНачисления", НачалоМесяца(Объект.ПериодНачисленияБазыРаспределения));		
		Запрос.УстановитьПараметр("спУслуги", Объект.БазаРаспределения.Выгрузить().ВыгрузитьКолонку("УслугаБазыРаспределения"));		
		Запрос.УстановитьПараметр("спЛицевыеСчета", Объект.ЛицевыеСчета.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));		
		Запрос.УстановитьПараметр("Здание", Объект.Здание);		
		
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
			НайденнаяСтрока = ТаблицаЗапроса.Найти(СтрокаЛицевыеСчета.ЛицевойСчет, "ЛицевойСчет");
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаЛицевыеСчета.КоличествоБазыРаспределения = НайденнаяСтрока.СуммаПриход;
			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыАванса()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	-РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток КАК СуммаАванса,
	|	РасчетыПоЛицевымСчетамОстаткиАвансы.ЛицевойСчет
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|			,
	|			Организация = &Организация
	|				И Услуга = &Услуга
	|				И МесяцНачисления = &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстаткиАвансы";

	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаЛицевыеСчета Из Объект.ЛицевыеСчета Цикл
		НайденнаяСтрока = ТаблицаЗапроса.Найти(СтрокаЛицевыеСчета.ЛицевойСчет, "ЛицевойСчет");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЛицевыеСчета.СуммаАванса = НайденнаяСтрока.СуммаАванса;
		
	КонецЦикла;

КонецПроцедуры

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Для Каждого СтрокаТаблицаДляЗагрузки Из ТаблицаДляЗагрузки Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет",	СтрокаТаблицаДляЗагрузки.ЛицевойСчет);
		Строки = Объект.ЛицевыеСчета.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Строки[0], СтрокаТаблицаДляЗагрузки);
		Иначе
			НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаДляЗагрузки);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура - обработчик события ПриИзменении поля ввода "Дата".
//
&НаКлиенте
Процедура ОтображениеДатыДокументаПриИзменении(Элемент)
	
	ЭтаФорма.Объект.Дата 		= НачалоМесяца(ЭтаФорма.Объект.Дата);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеДатыДокумента 	= Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "Дата".
//
&НаКлиенте
Процедура ОтображениеДатыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.Дата= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.Дата));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.Дата = НачалоМесяца(ДатаКалендаряНачало);
	
	ОтображениеДатыДокументаПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "Дата".
//
&НаКлиенте
Процедура ОтображениеДатыДокументаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	ЭтаФорма.Объект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.Дата), 
						ДобавитьМесяц(ЭтаФорма.Объект.Дата, Направление),
						ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));
						
	ОтображениеДатыДокументаПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет" табличной части "ЛицевыеСчета".
//
&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисленияБазыРаспределения".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияБазыРаспределенияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения	= КонецМесяца(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисленияБазыРаспределения 	= Формат(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисленияБазыРаспределения".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияБазыРаспределенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияБазыРаспределенияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисленияБазыРаспределения".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияБазыРаспределенияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисленияБазыРаспределения, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияБазыРаспределенияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры
